With v5.8.4, I'm getting the same thing but I'm also seeing more fields that have drifted.

For a full example:

```hcl
# cloudflare_pages_project.site will be updated in-place
~ resource "cloudflare_pages_project" "site" {
    - build_config         = {} -> null
    + canonical_deployment = (known after apply)
    ~ created_on           = "2025-08-29T22:32:31Z" -> (known after apply)
    - deployment_configs   = {
        - preview    = {
            - compatibility_date  = "2025-08-29" -> null
            - compatibility_flags = [] -> null
          } -> null
        - production = {
            - compatibility_date  = "2025-08-29" -> null
            - compatibility_flags = [] -> null
          } -> null
      } -> null
    ~ domains              = [
        - "fubar-site.pages.dev",
      ] -> (known after apply)
      id                   = "fubar-site"
    + latest_deployment    = (known after apply)
      name                 = "fubar-site"
    ~ source               = {
        ~ config = {
            - path_excludes                  = [] -> null
            - path_includes                  = [
                - "*",
              ] -> null
            - production_deployments_enabled = true -> null
              # (8 unchanged attributes hidden)
          }
          # (1 unchanged attribute hidden)
      }
    ~ subdomain            = "fubar-site.pages.dev" -> (known after apply)
      # (2 unchanged attributes hidden)
  }
```